<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"c6871e217dc6e9c6e4f86ea3d84452dd2cf38f2bd5e283e43dbaa783238c2a59","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #659 at https://github.com/cal-itp/data-infra/actions/runs/17842188085","plan_out_hash":"b067861ea8d99ce0f00cb43b50d72c4d6fa3b69cec871db27f6462bc44aa8636","plan_hash":"00656476fbf2b1271b42c10e9a939300fcfd854cb2e2f6e7cdab3dcd8bc7930f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "dKAn6w==" -> (known after apply)
!~      detect_md5hash      = "FPMQ3JZ3WbLypkEDLXIKbw==" -> "different hash"
!~      generation          = 1751587159442685 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "FPMQ3JZ3WbLypkEDLXIKbw==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["seeds/payments_entity_mapping.csv"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "2yShtQ==" -> (known after apply)
!~      detect_md5hash      = "BKdiHn72p4k34cBd6r6rBQ==" -> "different hash"
!~      generation          = 1755275090384610 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/seeds/payments_entity_mapping.csv"
!~      md5hash             = "BKdiHn72p4k34cBd6r6rBQ==" -> (known after apply)
        name                = "data/warehouse/seeds/payments_entity_mapping.csv"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #659](https://github.com/cal-itp/data-infra/actions/runs/17842188085)